### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
purchase_clean = purchase_data.dropna(how = "any")
purchase_clean.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [4]:
total_players = len(purchase_clean["SN"].unique())
print(total_players)

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
unique_items = purchase_clean["Item Name"].unique()
unique_items_int = len(unique_items)
unique_items_int

179

In [6]:
avg_price = purchase_clean["Price"].mean()
round_avg_price = round(avg_price, 2)
round_avg_price

3.05

In [7]:
num_purchases = len(purchase_clean["Purchase ID"])
num_purchases

780

In [8]:
total_revenue = purchase_clean["Price"].sum()
total_revenue

2379.77

In [9]:
df_summary = pd.DataFrame({"Number of Unique Items": [unique_items_int], "Average Price": [round_avg_price], 
                           "Number of Purchases": [num_purchases], "Total Revenue": [total_revenue]})

df_summary["Total Revenue"] = df_summary["Total Revenue"].astype(float).map("${:,.2f}".format)
df_summary["Average Price"] = df_summary["Average Price"].astype(float).map("${:,.2f}".format)
df_summary

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
gender_demo = purchase_clean.groupby("Gender")

unique_gender = gender_demo.nunique()["SN"]

percentage_gender = unique_gender / total_players *100
percentage_gender

df_gender_demo = pd.DataFrame({"Gender count": unique_gender, "Percentage Gender": percentage_gender})

df_gender_demo["Percentage Gender"] = df_gender_demo["Percentage Gender"].astype(float).map("{:,.2f}%".format)
df_gender_demo

                       Gender count Percentage Gender
Gender
Female                           81            14.06%
Male                            484            84.03%
Other / Non-Disclosed            11             1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [96]:
avg_purchase_gender = purchase_clean.groupby("Gender")["Price"].mean()
purchase_total_gender = purchase_clean.groupby("Gender")["Price"].sum()
purchase_count_gender = purchase_clean.groupby("Gender")["Purchase ID"].count()
avg_purchase_gender = 0

In [99]:
df_gender_purchase = pd.DataFrame({"Average Purchase Price": avg_purchase_gender,
                                   "Purchase Count": purchase_count_gender,
                                   "Total Purchase Value": purchase_total_gender
                                  })
df_gender_purchase

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,0,361.94
Male,652,0,1967.64
Other / Non-Disclosed,15,0,50.19

In [98]:
purchase_total_gender = purchase_clean.groupby("Gender")["Price"].sum()
purchase_total_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [74]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [75]:
purchase_data["Age Group"] = pd.cut(purchase_data["Age"], bins, labels = group_names)
df_purchase_demo = purchase_data.groupby("Age Group")
clean_sn = df_purchase_demo.nunique()["SN"]

In [76]:
percentage_ages = clean_sn / total_players * 100

In [77]:
df_age_bins = pd.DataFrame({"Total Count": clean_sn, "Percentage of Players": percentage_ages})
df_age_bins["Percentage of Players"] = df_age_bins["Percentage of Players"].astype(float).map("{:,.2f}%".format)
df_age_bins

           Total Count Percentage of Players
Age Group
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [22]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-3940+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,15-19
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,15-19
4,4,Iskosia90,23,Male,131,Fury,1.44,15-19

In [67]:
bins = [0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 100]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [88]:
purchase_data["Age Group"] = pd.cut(purchase_data["Age"], bins, labels = group_names)
mean_per_age = purchase_data.groupby("Age Group")['Price'].mean()
count_by_age = purchase_data.groupby("Age Group")['Purchase ID'].count()
purchase_sum = purchase_data.groupby("Age Group")['Price'].sum()
avg_per_person = purchase_data.groupby(["Age Group", "SN"])["Price"].mean()
type(avg_per_person)

pandas.core.series.Series

In [89]:
df_age_purchase_summary = pd.DataFrame({"Purchase Count": count_by_age, "Average Purchase Price": mean_per_age,
                                       "Total Purchase Value": purchase_sum, 
#                                        "Avg Total Purchase per Person": avg_per_person
                                       })

In [82]:
df_age_purchase_summary

           Purchase Count  Average Purchase Price  Total Purchase Value
Age Group
<10                    23                3.353478                 77.13
10-14                  28                2.956429                 82.78
15-19                 136                3.035956                412.89
20-24                 365                3.052219               1114.06
25-29                 101                2.900990                293.00
30-34                  73                2.931507                214.00
35-39                  41                3.601707                147.67
40+                    13                2.941538                 38.24

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80